7767517
96 110
Input                    input0                   0 1 input0
Convolution              259                      1 1 input0 261 0=16 1=3 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     262                      1 1 261 264 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              265                      1 1 264 267 0=32 1=1 5=1 6=512 9=1
ConvolutionDepthWise     268                      1 1 267 270 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              271                      1 1 270 273 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     274                      1 1 273 276 0=32 1=3 4=1 5=1 6=288 7=32 9=1
Convolution              277                      1 1 276 279 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     280                      1 1 279 282 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              283                      1 1 282 285 0=64 1=1 5=1 6=2048 9=1
ConvolutionDepthWise     286                      1 1 285 288 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              289                      1 1 288 291 0=64 1=1 5=1 6=4096 9=1
ConvolutionDepthWise     292                      1 1 291 294 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              295                      1 1 294 297 0=64 1=1 5=1 6=4096 9=1
Split                    splitncnn_0              1 4 297 297_splitncnn_0 297_splitncnn_1 297_splitncnn_2 297_splitncnn_3
Convolution              298                      1 1 297_splitncnn_3 298 0=8 1=1 5=1 6=512
Convolution              300                      1 1 298 302 0=16 1=3 4=1 5=1 6=1152 9=1
Convolution              303                      1 1 302 303 0=16 1=3 2=2 4=2 5=1 6=2304
Convolution              305                      1 1 297_splitncnn_2 305 0=8 1=1 5=1 6=512
Convolution              307                      1 1 305 309 0=16 1=3 4=1 5=1 6=1152 9=1
Convolution              310                      1 1 309 310 0=16 1=3 2=3 4=3 5=1 6=2304
Convolution              312                      1 1 297_splitncnn_1 312 0=8 1=1 5=1 6=512
Convolution              314                      1 1 312 316 0=12 1=3 4=1 5=1 6=864 9=1
Convolution              317                      1 1 316 319 0=16 1=3 4=1 5=1 6=1728 9=1
Convolution              320                      1 1 319 320 0=16 1=3 2=5 4=5 5=1 6=2304
Concat                   322                      3 1 303 310 320 322
Convolution              323                      1 1 322 323 0=64 1=1 5=1 6=3072
Convolution              325                      1 1 297_splitncnn_0 325 0=64 1=1 5=1 6=4096
BinaryOp                 327                      2 1 323 325 327
ReLU                     328                      1 1 327 328
Split                    splitncnn_1              1 4 328 328_splitncnn_0 328_splitncnn_1 328_splitncnn_2 328_splitncnn_3
ConvolutionDepthWise     329                      1 1 328_splitncnn_3 331 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              332                      1 1 331 334 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     335                      1 1 334 337 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              338                      1 1 337 340 0=128 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     341                      1 1 340 343 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              344                      1 1 343 346 0=128 1=1 5=1 6=16384 9=1
Split                    splitncnn_2              1 4 346 346_splitncnn_0 346_splitncnn_1 346_splitncnn_2 346_splitncnn_3
ConvolutionDepthWise     347                      1 1 346_splitncnn_3 349 0=128 1=3 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              350                      1 1 349 352 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     353                      1 1 352 355 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              356                      1 1 355 358 0=256 1=1 5=1 6=65536 9=1
Split                    splitncnn_3              1 4 358 358_splitncnn_0 358_splitncnn_1 358_splitncnn_2 358_splitncnn_3
Convolution              359                      1 1 358_splitncnn_3 360 0=64 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     361                      1 1 360 362 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              363                      1 1 362 364 0=256 1=1 5=1 6=16384 9=1
Split                    splitncnn_4              1 3 364 364_splitncnn_0 364_splitncnn_1 364_splitncnn_2
ConvolutionDepthWise     365                      1 1 328_splitncnn_2 366 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              367                      1 1 366 367 0=12 1=1 5=1 6=768
Permute                  368                      1 1 367 368 0=3
ConvolutionDepthWise     369                      1 1 328_splitncnn_1 370 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              371                      1 1 370 371 0=6 1=1 5=1 6=384
Permute                  372                      1 1 371 372 0=3
ConvolutionDepthWise     373                      1 1 328_splitncnn_0 374 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              375                      1 1 374 375 0=30 1=1 5=1 6=1920
Permute                  376                      1 1 375 376 0=3
ConvolutionDepthWise     377                      1 1 346_splitncnn_2 378 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              379                      1 1 378 379 0=8 1=1 5=1 6=1024
Permute                  380                      1 1 379 380 0=3
ConvolutionDepthWise     381                      1 1 346_splitncnn_1 382 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              383                      1 1 382 383 0=4 1=1 5=1 6=512
Permute                  384                      1 1 383 384 0=3
ConvolutionDepthWise     385                      1 1 346_splitncnn_0 386 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              387                      1 1 386 387 0=20 1=1 5=1 6=2560
Permute                  388                      1 1 387 388 0=3
ConvolutionDepthWise     389                      1 1 358_splitncnn_2 390 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              391                      1 1 390 391 0=8 1=1 5=1 6=2048
Permute                  392                      1 1 391 392 0=3
ConvolutionDepthWise     393                      1 1 358_splitncnn_1 394 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              395                      1 1 394 395 0=4 1=1 5=1 6=1024
Permute                  396                      1 1 395 396 0=3
ConvolutionDepthWise     397                      1 1 358_splitncnn_0 398 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              399                      1 1 398 399 0=20 1=1 5=1 6=5120
Permute                  400                      1 1 399 400 0=3
Convolution              401                      1 1 364_splitncnn_2 401 0=12 1=3 4=1 5=1 6=27648
Permute                  402                      1 1 401 402 0=3
Convolution              403                      1 1 364_splitncnn_1 403 0=6 1=3 4=1 5=1 6=13824
Permute                  404                      1 1 403 404 0=3
Convolution              405                      1 1 364_splitncnn_0 405 0=30 1=3 4=1 5=1 6=69120
Permute                  406                      1 1 405 406 0=3
Reshape                  416                      1 1 368 416 0=4 1=-1
Reshape                  426                      1 1 380 426 0=4 1=-1
Reshape                  436                      1 1 392 436 0=4 1=-1
Reshape                  446                      1 1 402 446 0=4 1=-1
Concat                   output0                  4 1 416 426 436 446 output0
Reshape                  457                      1 1 372 457 0=2 1=-1
Reshape                  467                      1 1 384 467 0=2 1=-1
Reshape                  477                      1 1 396 477 0=2 1=-1
Reshape                  487                      1 1 404 487 0=2 1=-1
Concat                   488                      4 1 457 467 477 487 488
Reshape                  498                      1 1 376 498 0=10 1=-1
Reshape                  508                      1 1 388 508 0=10 1=-1
Reshape                  518                      1 1 400 518 0=10 1=-1
Reshape                  528                      1 1 406 528 0=10 1=-1
Concat                   529                      4 1 498 508 518 528 529
Softmax                  530                      1 1 488 530 0=1 1=1
